Repository: AikanShykhmamedov/dodo_pizza
Catalog: lib/localization/src/l10n/intl_*.arb
Languages: ru

source: Menu
ru: Меню

# menuCategoryName
source: {category, select, pizza {Pizza} combo {Combo} snacks {Snacks} desserts {Desserts} drinks {Drinks} sauces {Sauces} goods {Goods} other {}}
ru: {category, select, pizza {Пицца} combo {Комбо} snacks {Закуски} desserts {Десерты} drinks {Напитки} sauces {Соусы} goods {Другие товары} other {}}

# menuPriceFromCount
source: from £{value}
ru: от {value} ₽

# menuOfferAddBasket
source: Add to basket
ru: В корзину

# menuOfferAddBasketForCount
source: Add to basket for £{value}
ru: В корзину за {value} ₽

# menuOfferAddTaste
source: Add to taste
ru: Добавить по вкусу

# menuOfferWeightCount
source: {value} g
ru: {value} г

# menuOfferVolumeCount
source: {value} l
ru: {value} л

# menuOfferPieceCount
source: {value} pcs.
ru: {value} шт.

# menuOfferDiameterName
source: {diameter, select, small {Small} medium {Medium} large {Large} other {}}
ru: {diameter, select, small {Маленькая} medium {Средняя} large {Большая} other {}}

# menuOfferDiameterFullName
source: {diameter, select, small {Small} medium {Medium} large {Large} other {}}
ru: {diameter, select, small {Маленькая 25 см} medium {Средняя 30 см} large {Большая 35 см} other {}}

# menuOfferDoughName
source: {dough, select, original {Original} thin {Thin} other {}}
ru: {dough, select, original {Традиционное} thin {Тонкое} other {}}

# menuOfferDoughFullName
source: {dough, select, original {Original crust} thin {Thin crust} other {}}
ru: {dough, select, original {Традиционное тесто} thin {Тонкое тесто} other {}}

# menuOfferRemoveIngredients
source: Remove ingredients
ru: Убрать ингредиенты

# menuOfferRemoveIngredientsDialogReset
source: Reset
ru: Сбросить

# menuOfferRemoveIngredientsDialogDone
source: Done
ru: Готово

# menuOfferComboSlotChange
source: Change
ru: Заменить

# menuOfferComboSlotDialogPageOf
source: {currentPage} of {pagesCount}
ru: {currentPage} из {pagesCount}

# menuOfferComboSlotProductCardChangeComposition
source: Change composition
ru: Изменить состав

# menuOfferComboSlotProductCardChangeIngredients
source: Can be removed
ru: Можно удалить

# menuOfferComboSlotProductCardAddDeal
source: Add to deal
ru: Выбрать

# menuOfferComboSlotProductCardCancel
source: Cancel
ru: Отмена

# menuOfferComboSlotProductCardSave
source: Save
ru: Сохранить

# menuOfferComboSlotProductCardSelected
source: Selected
ru: Уже в комбо

# menuFoodValueNutritionFacts
source: Nutrition facts (per 100 g)
ru: Пищевая ценность на 100 г

# menuFoodValueCalories
source: Calories
ru: Энерг. ценность

# menuFoodValueProteins
source: Proteins
ru: Белки

# menuFoodValueFats
source: Fats
ru: Жиры

# menuFoodValueCarbohydrates
source: Carbohydrates
ru: Углеводы

# menuFoodValueWeight
source: Weight
ru: Вес

# menuFoodValueKcalValue
source: {value} kcal
ru: {value} ккал

# menuFoodValueGramsValue
source: {value} g
ru: {value} г

source: Profile
ru: Профиль

# profileLetGetAcquainted
source: Let's get acquainted!
ru: Давайте знакомиться!

# profileLetGetAcquaintedContent
source: Save your delivery address and be the first one to know about our promotions
ru: Подарим подарок на день рождения, сохраним адрес доставки и расскажем об акциях

# profileEnterPhoneNumber
source: Enter the phone number
ru: Указать телефон

source: Contact
ru: Контакты

# contactMap
source: See the map
ru: Пиццерии на карте

source: Contact support
ru: Связаться с поддержкой

# contactCall
source: Call
ru: Позвонить

# contactChat
source: Chat
ru: Чат

# contactLegalDocuments
source: Legal documents
ru: Правовые документы

# contactAboutApp
source: About our App
ru: О приложении

source: Basket
ru: Корзина

# basketEmpty
source: Oops, it's empty here!
ru: Ой, пусто!

# basketEmptyContent
source: Your basket is empty, open the menu to get started.
ru: Ваша корзина пуста, добавьте понравившийся товар из «Меню».

# basketEmptyDelivery
source: Minimum order amount for delivery is £10
ru: Мы доставим ваш заказ от 549 ₽

# basketGoToMenu
source: Go to menu
ru: Перейти в меню

# regionCountry
source: Country
ru: Страна

# regionCountryName
source: {isoName, select, BY {Belarus} CZ {Czech Republic} DE {Germany} EE {Estonia} FI {Finland} GB {United Kingdom} KG {Kyrgyzstan} KZ {Kazakhstan} LT {Lithuania} NG {Nigeria} PL {Poland} RO {Romania} RU {Russia} SI {Slovenia} SK {Slovakia} TJ {Tajikistan} UZ {Uzbekistan} VN {Vietnam} other {}}
ru: {isoName, select, BY {Беларусь} CZ {Чехия} DE {Германия} EE {Эстония} FI {Финляндия} GB {Великобритания} KG {Кыргызстан} KZ {Казахстан} LT {Литва} NG {Нигерия} PL {Польша} RO {Румыния} RU {Россия} SI {Словения} SK {Словакия} TJ {Таджикистан} UZ {Узбекистан} VN {Вьетнам} other {}}

# regionCitySearchHint
source: Choose your city
ru: Найти город

# regionCitySearchEmpty
source: No pizza store has opened yet in this city
ru: Пиццерия в этом городе еще не открылась
